##Треугольник существует только тогда, когда сумма любых двух его сторон больше третьей.
# Дано a, b, c - стороны предполагаемого треугольника.
# Требуется сравнить длину каждого отрезка-стороны с суммой двух других.
# Если хотя бы в одном случае отрезок окажется больше суммы двух других,то треугольника с такими сторонами не существует.
# Отдельно сообщить является ли треугольник разносторонним, равнобедренным или равносторонним.



a = int(input('Введите длину стороны а: '))
b = int(input('Введите длину стороны b: '))
c = int(input('Введите длину стороны c: '))

if a > b + c or b > a + c  or c > a + b :
    print('Треугольника с такими сторонами не существует, мне очень жаль...')
elif a == b == c :
    print('Ваш треугольник равносторонний')
elif a == b or b == c or c == a:
    print('Ваш треугольник равнобедренный')
elif a != b and a!=c:
    print('Ваш треугольник разносторонний')
